## plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=515ce96f34f9c7a45fdec2cb74b073075a85e824]
data.http.my_public_ip: Reading...
module.complete.data.archive_file.lambda_zip: Reading...
random_id.this: Refreshing state... [id=Pw]
module.complete.data.http.my_public_ip: Reading...
module.complete.random_id.this: Refreshing state... [id=9w]
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.complete.data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
data.http.my_public_ip: Read complete after 1s [id=https://ifconfig.co/json]
data.aws_region.current: Reading...
module.complete.data.aws_availability_zones.available: Reading...
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-complete3f]
module.complete.data.aws_caller_identity.current: Reading...
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt]
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv]
data.aws_availability_zones.available: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Read complete after 0s [id=3693445097]
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_iam_policy_document.lambda_execution_inline_policy: Reading...
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.lambda_execution_inline_policy: Read complete after 0s [id=2902369118]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-f7]
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1b"]: Reading...
data.aws_availability_zone.available["us-west-1c"]: Reading...
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt|2F7050A9-DDF6-47C5-81AE-B8C9F4DFDAA9]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv|67E3D23B-5EB3-459A-AFEA-68D46952CB43]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt|69721694-D503-40E8-A738-8158C2BBCC75]
module.complete.data.template_file.user_data: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=9d94336d1d5f21c267e5f5377b0337786596db32709552f5082f4481e4ea58f6]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=2465972644]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=2051964274]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 0s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 0s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 0s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-f7-447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0db6232b295737a14]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 1s [id=ami-0fb2a8cf2684fdb0c]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-0804d4c6665d3ea52]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-02a3a14ada345bdfa]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-0405b5473a0a97771]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09a7fe172ce55073e]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-0c83516c3117401be]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0fafda5febfc17189]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0f51f5664c91fe53e]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-01c62786f091a7c58]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-0804d4c6665d3ea521080289494]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0682ab1fc14b89c69]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-07ac472f886fd21a4]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-050201b64ab436118]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-0fa73f03d88d76a91]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-0f51f5664c91fe53e1080289494]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-05fa3e241aa846ac2]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-f7]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-0c2fdbf3d8e50b757]
module.complete.aws_instance.this: Refreshing state... [id=i-0c43ecc2e8630bddc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # module.complete.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                        = "eipalloc-05fa3e241aa846ac2"
      ~ tags                      = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.complete.aws_iam_instance_profile.this will be updated in-place
  ~ resource "aws_iam_instance_profile" "this" {
        id          = "ec2-instance-profile-SOPHOS_CNF-f7"
        name        = "ec2-instance-profile-SOPHOS_CNF-f7"
      ~ tags        = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_iam_role.lambda_execution_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_execution_role" {
        id                    = "LambdaExecutionRole-SOPHOS_CNF-f7"
        name                  = "LambdaExecutionRole-SOPHOS_CNF-f7"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

+       inline_policy {
+           name   = "lambda-config-policy-SOPHOS_CNF-f7"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "ec2:DescribeNetworkInterfaces",
+                               "ec2:DescribeInstances",
+                               "ec2:DeleteNetworkInterface",
+                               "ec2:CreateNetworkInterface",
+                               "ec2:AttachNetworkInterface",
                            ]
+                           Effect   = "Allow"
+                           Resource = "*"
+                           Sid      = ""
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
-       inline_policy {
-           name   = "lambda-config-policy-SOPHOS_CNF-f7" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "ec2:DescribeNetworkInterfaces",
-                               "ec2:DescribeInstances",
-                               "ec2:DeleteNetworkInterface",
-                               "ec2:CreateNetworkInterface",
-                               "ec2:AttachNetworkInterface",
                            ]
-                           Effect   = "Allow"
-                           Resource = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-0682ab1fc14b89c69"
-                           Sid      = ""
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.complete.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-SOPHOS_CNF-f7-447552758530"
        name                  = "ec2-iam-role-SOPHOS_CNF-f7-447552758530"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.complete.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0c43ecc2e8630bddc"
      ~ source_dest_check                    = false -> true
      ~ tags                                 = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ user_data                            = "08c43b2ecc13f67fac8bfc64d00a248a00601063" -> "5a1f2c9a77cbe6f2d4ef09dac0ff53c4bebe2f4e"
        # (28 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.complete.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-09a7fe172ce55073e"
      ~ tags     = {
-           "Name"          = "igw-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all = {
-           "Name"          = "igw-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.complete.aws_lambda_function.this will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "../../initial_config.zip"
+       function_name                  = "XG-Initial-Config-SOPHOS_CNF-f7"
+       handler                        = "config.main"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-f7"
+       runtime                        = "python3.7"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "CONSOLE_SECRET_NAME" = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv"
+               "IP"                  = "10.0.1.75"
+               "PASSWORD"            = "admin"
+               "REGION_NAME"         = "us-west-1"
+               "USERNAME"            = "admin"
            }
        }

+       ephemeral_storage {
+           size = (known after apply)
        }

+       tracing_config {
+           mode = (known after apply)
        }

+       vpc_config {
+           security_group_ids = [
+               "sg-0405b5473a0a97771",
            ]
+           subnet_ids         = [
+               "subnet-02a3a14ada345bdfa",
            ]
+           vpc_id             = (known after apply)
        }
    }

  # module.complete.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-0c2fdbf3d8e50b757"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "launch-template-SOPHOS_CNF-f7-447552758530"
      ~ tags                    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
        id                        = "eni-0682ab1fc14b89c69"
      ~ tags                      = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_network_interface.public will be updated in-place
  ~ resource "aws_network_interface" "public" {
        id                        = "eni-050201b64ab436118"
      ~ tags                      = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0f51f5664c91fe53e"
      ~ tags             = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0804d4c6665d3ea52"
      ~ tags             = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.lan[0] will be updated in-place
  ~ resource "aws_security_group" "lan" {
        id                     = "sg-0405b5473a0a97771"
        name                   = "Private Subnet"
      ~ tags                   = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.public[0] will be updated in-place
  ~ resource "aws_security_group" "public" {
        id                     = "sg-0c83516c3117401be"
        name                   = "Public"
      ~ tags                   = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-0fafda5febfc17189"
      ~ ingress                = [
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "138.91.150.226/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
-           {
-               cidr_blocks      = [
-                   "47.184.79.94/32",
-                   "20.9.10.243/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
      ~ tags                   = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.complete.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01c62786f091a7c58"
      ~ tags                                           = {
-           "Name"          = "public-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
-           "Name"          = "public-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.complete.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0db6232b295737a14"
      ~ tags                             = {
-           "Name"          = "SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                         = {
-           "Name"          = "SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 16 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```